In [1]:
#Import pandas library
import pandas as pd
import datetime

In [2]:
#Reading the csv files
title = pd.read_csv("title.csv")
bonus = pd.read_csv("bonus.csv")
worker = pd.read_csv("worker.csv")

Backing off send_request(...) for 0.7s (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEB4CC9D0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))
Backing off send_request(...) for 14.7s (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEB4CC100>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))

In [3]:
#Viewing first five rows
title.head()

   worker_ref_id               worker_title        affected_from
0              1  Manager                    2016-02-20 00:00:00
1              2  Executive                  2016-06-11 00:00:00
2              8  Executive                  2016-06-11 00:00:00
3              5  Manager                    2016-06-11 00:00:00
4              4  Asst. Manager              2016-06-11 00:00:00

In [4]:
bonus.head()

   worker_ref_id  bonus_amount           bonus_date
0              1          5000  2020-02-16 00:00:00
1              2          3000  2011-06-16 00:00:00
2              3          4000  2020-02-16 00:00:00
3              1          4500  2020-02-16 00:00:00
4              2          3500  2011-06-16 00:00:00

In [5]:
worker.head()

,worker_id,first_name,last_name,salary,joining_date,department
0,1,Monika,Arora,100000,2014-02-20 09:00:00,HR
1,2,Niharika,Verma,80000,2014-06-11 09:00:00,Admin
2,3,Vishal,Singhal,300000,2014-02-20 09:00:00,HR
3,4,Amitabh,Singh,500000,2014-02-20 09:00:00,Admin
4,5,Vivek,Bhati,500000,2014-06-11 09:00:00,Admin

In [6]:
#Checking data types
title.dtypes

worker_ref_id     int64
worker_title     object
affected_from    object
dtype: object

In [7]:
bonus.dtypes

worker_ref_id     int64
bonus_amount      int64
bonus_date       object
dtype: object

In [8]:
worker.dtypes

worker_id        int64
first_name      object
last_name       object
salary           int64
joining_date    object
department      object
dtype: object

In [9]:
#Converting to datetime object
title['affected_from'] = pd.to_datetime(title['affected_from'])
bonus['bonus_date'] = pd.to_datetime(bonus['bonus_date'])
worker['joining_date'] = pd.to_datetime(worker['joining_date'])

In [10]:
#Confirming data type
worker.dtypes

worker_id                int64
first_name              object
last_name               object
salary                   int64
joining_date    datetime64[ns]
department              object
dtype: object

In [11]:
# Add new columns 'year', 'month', and 'day'
title['year'] = title['affected_from'].dt.year
title['month'] = title['affected_from'].dt.month
title['day'] = title['affected_from'].dt.day

Backing off send_request(...) for 3.1s (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEB4CC8E0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))

In [12]:
# Add new columns 'year', 'month', and 'day'
bonus['year'] = bonus['bonus_date'].dt.year
bonus['month'] = bonus['bonus_date'].dt.month
bonus['day'] = bonus['bonus_date'].dt.day

In [13]:
# Add new columns 'year', 'month', and 'day'
worker['year'] = worker['joining_date'].dt.year
worker['month'] = worker['joining_date'].dt.month
worker['day'] = worker['joining_date'].dt.day

In [14]:
title.head()

   worker_ref_id               worker_title affected_from  year  month  day
0              1  Manager                      2016-02-20  2016      2   20
1              2  Executive                    2016-06-11  2016      6   11
2              8  Executive                    2016-06-11  2016      6   11
3              5  Manager                      2016-06-11  2016      6   11
4              4  Asst. Manager                2016-06-11  2016      6   11

In [15]:
bonus.head()

   worker_ref_id  bonus_amount bonus_date  year  month  day
0              1          5000 2020-02-16  2020      2   16
1              2          3000 2011-06-16  2011      6   16
2              3          4000 2020-02-16  2020      2   16
3              1          4500 2020-02-16  2020      2   16
4              2          3500 2011-06-16  2011      6   16

In [16]:
worker.head()

,worker_id,first_name,last_name,salary,joining_date,department,year,month,day
0,1,Monika,Arora,100000,2014-02-20 09:00:00,HR,2014,2,20
1,2,Niharika,Verma,80000,2014-06-11 09:00:00,Admin,2014,6,11
2,3,Vishal,Singhal,300000,2014-02-20 09:00:00,HR,2014,2,20
3,4,Amitabh,Singh,500000,2014-02-20 09:00:00,Admin,2014,2,20
4,5,Vivek,Bhati,500000,2014-06-11 09:00:00,Admin,2014,6,11

In [17]:
#  Q-1. Write Pandas code to fetch "FIRST_NAME" from Worker table using the alias name as <WORKER_NAME>.
result = worker['first_name'].rename('WORKER_NAME')
# Displaying the result
print(result)

0    Monika
1    Niharika
2    Vishal
3    Amitabh
4    Vivek
5    Vipul
6    Satish
7    Geetika
Name: WORKER_NAME, dtype: object

In [18]:
#  Q-2. Write Pandas code to fetch "FIRST_NAME" from Worker table in upper case.
worker.first_name.str.upper()

0    MONIKA
1    NIHARIKA
2    VISHAL
3    AMITABH
4    VIVEK
5    VIPUL
6    SATISH
7    GEETIKA
Name: first_name, dtype: object

In [19]:
# Q-3. Write Pandas code to fetch unique values of DEPARTMENT from Worker table.
#worker['department'].unique()
pd.DataFrame(worker['department'].unique())
#pd.unique(worker['department'])

                           0
0  HR
1  Admin
2  Account

In [20]:
# Q-4. Write Pandas code to print the first three characters of  FIRST_NAME from Worker table.
first_three_chars = worker['first_name'].str[:3]
print(first_three_chars)

0    Mon
1    Nih
2    Vis
3    Ami
4    Viv
5    Vip
6    Sat
7    Gee
Name: first_name, dtype: object

In [21]:
# Q-5. Write Pandas code to find the position of the alphabet ('a') in the first name column 'Amitabh' from Worker table.

filtered_rows = worker[worker['first_name'].str.strip() == 'Amitabh']

# Finding the position of 'a' in the 'first_name' column for the filtered rows
positions_of_a = filtered_rows['first_name'].str.find('a')

print(positions_of_a)

3    4
Name: first_name, dtype: int64

In [22]:
#  Q-6. Write Pandas code to print the FIRST_NAME from Worker table after removing white spaces from the right side.

worker['FIRST_NAME_stripped'] = worker['first_name'].str.rstrip()

# Printing the result
print(worker['FIRST_NAME_stripped'])

0      Monika
1    Niharika
2      Vishal
3     Amitabh
4       Vivek
5       Vipul
6      Satish
7     Geetika
Name: FIRST_NAME_stripped, dtype: object

In [23]:
#  Q-7. Write Pandas code to print the DEPARTMENT from Worker table after removing white spaces from the left side.

worker['FIRST_NAME_stripped'] = worker['first_name'].str.lstrip()

# Printing the result
print(worker['FIRST_NAME_stripped'])

0    Monika
1    Niharika
2    Vishal
3    Amitabh
4    Vivek
5    Vipul
6    Satish
7    Geetika
Name: FIRST_NAME_stripped, dtype: object

In [24]:
#  Q-8. Write Pandas code that fetches the unique values of DEPARTMENT  from Worker  table and prints its length.

unique_departments = worker['department'].unique()
lengths = [len(worker[worker['department'] == dep]) for dep in unique_departments]

# Creating a DataFrame with two columns
unique_departments_df = pd.DataFrame({'Unique_Department': unique_departments, 'Length': lengths})

# Printing the DataFrame
print("Unique Departments DataFrame:")
print(unique_departments_df)

Unique Departments DataFrame:
           Unique_Department  Length
0  HR                              2
1  Admin                           4
2  Account                         2

In [25]:
# Q-9. Write Pandas code to print the FIRST_NAME from Worker  table after replacing 'a' with 'A'.

worker['FIRST_NAME_modified'] = worker['first_name'].str.replace('a', 'A')
worker['FIRST_NAME_modified']

0    MonikA
1    NihArikA
2    VishAl
3    AmitAbh
4    Vivek
5    Vipul
6    SAtish
7    GeetikA
Name: FIRST_NAME_modified, dtype: object

In [26]:
#  Q-10. Write Pandas code to print the FIRST_NAME and LAST_NAME from Worker table into a single  column COMPLETE_NAME. 
#A space char should separate them.

worker['COMPLETE_NAME'] = worker['first_name'].str.strip() + ' ' + worker['last_name'].str.strip()
worker['COMPLETE_NAME']

0       Monika Arora
1     Niharika Verma
2     Vishal Singhal
3      Amitabh Singh
4        Vivek Bhati
5        Vipul Diwan
6       Satish Kumar
7    Geetika Chauhan
Name: COMPLETE_NAME, dtype: object

In [27]:
# Q-11 Write an Pandas code to Print all Worker details from the Worker table ordered by FIRST_NAME Ascending.

sorted_worker = worker.sort_values(by='first_name', ascending=True)

# Printing the result
print("Worker details ordered by FIRST_NAME (Ascending):")
print(sorted_worker)

Worker details ordered by FIRST_NAME (Ascending):
   worker_id                 first_name                  last_name  salary  \
3          4  Amitabh                    Singh                      500000
7          8  Geetika                    Chauhan                     90000
0          1  Monika                     Arora                      100000
1          2  Niharika                   Verma                       80000
6          7  Satish                     Kumar                       75000
5          6  Vipul                      Diwan                      200000
2          3  Vishal                     Singhal                    300000
4          5  Vivek                      Bhati                      500000

         joining_date                 department  year  month  day  \
3 2014-02-20 09:00:00  Admin                      2014      2   20
7 2014-04-11 09:00:00  Admin                      2014      4   11
0 2014-02-20 09:00:00  HR                         2014      2   20
1 2014-06-11 09:00:00  Admin                      2014      6   11
6 2014-01-20 09:00:00  Account                    2014      1   20
5 2014-06-11 09:00:00  Account                    2014      6   11
2 2014-02-20 09:00:00  HR                         2014      2   20
4 2014-06-11 09:00:00  Admin                      2014      6   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
3  Amitabh                    AmitAbh                      Amitabh Singh
7  Geetika                    GeetikA                    Geetika Chauhan
0  Monika                     MonikA                        Monika Arora
1  Niharika                   NihArikA                    Niharika Verma
6  Satish                     SAtish                        Satish Kumar
5  Vipul                      Vipul                          Vipul Diwan
2  Vishal                     VishAl                      Vishal Singhal
4  Vivek                      Vivek                          Vivek Bhati

In [28]:
# Q-12 Write an Pandas code to Print all Worker details from the Worker table ordered by FIRST_NAME Ascending and 
#DEPARTMENT Descending.

sorted_worker = worker.sort_values(by=['first_name', 'department'], ascending=[True, False])

# Printing the result
print("Worker details ordered by FIRST_NAME (Ascending) and DEPARTMENT (Descending):")
print(sorted_worker)

Worker details ordered by FIRST_NAME (Ascending) and DEPARTMENT (Descending):
   worker_id                 first_name                  last_name  salary  \
3          4  Amitabh                    Singh                      500000
7          8  Geetika                    Chauhan                     90000
0          1  Monika                     Arora                      100000
1          2  Niharika                   Verma                       80000
6          7  Satish                     Kumar                       75000
5          6  Vipul                      Diwan                      200000
2          3  Vishal                     Singhal                    300000
4          5  Vivek                      Bhati                      500000

         joining_date                 department  year  month  day  \
3 2014-02-20 09:00:00  Admin                      2014      2   20
7 2014-04-11 09:00:00  Admin                      2014      4   11
0 2014-02-20 09:00:00  HR                         2014      2   20
1 2014-06-11 09:00:00  Admin                      2014      6   11
6 2014-01-20 09:00:00  Account                    2014      1   20
5 2014-06-11 09:00:00  Account                    2014      6   11
2 2014-02-20 09:00:00  HR                         2014      2   20
4 2014-06-11 09:00:00  Admin                      2014      6   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
3  Amitabh                    AmitAbh                      Amitabh Singh
7  Geetika                    GeetikA                    Geetika Chauhan
0  Monika                     MonikA                        Monika Arora
1  Niharika                   NihArikA                    Niharika Verma
6  Satish                     SAtish                        Satish Kumar
5  Vipul                      Vipul                          Vipul Diwan
2  Vishal                     VishAl                      Vishal Singhal
4  Vivek                      Vivek                          Vivek Bhati

In [29]:
 # Q-13 Write an Pandas code to Print details for Workers with the first names "Vipul" and "Satish" from the Worker table.

selected_workers = worker[worker['first_name'].str.strip().isin(['Vipul', 'Satish'])]

# Printing the result
print("Details for Workers with the first names 'Vipul' and 'Satish':")
print(selected_workers)

Details for Workers with the first names 'Vipul' and 'Satish':
   worker_id                 first_name                  last_name  salary  \
5          6  Vipul                      Diwan                      200000
6          7  Satish                     Kumar                       75000

         joining_date                 department  year  month  day  \
5 2014-06-11 09:00:00  Account                    2014      6   11
6 2014-01-20 09:00:00  Account                    2014      1   20

         FIRST_NAME_stripped        FIRST_NAME_modified COMPLETE_NAME
5  Vipul                      Vipul                       Vipul Diwan
6  Satish                     SAtish                     Satish Kumar

In [30]:
# Q-14 Write an Pandas code to Print details of workers excluding first names, "Vipul" and "Satish" from the Worker table.

filtered_workers = worker[~worker['first_name'].str.strip().isin(['Vipul', 'Satish'])]

# Printing the result
print("Details of workers excluding first names 'Vipul' and 'Satish':")
print(filtered_workers)

Details of workers excluding first names 'Vipul' and 'Satish':
   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
1          2  Niharika                   Verma                       80000
2          3  Vishal                     Singhal                    300000
3          4  Amitabh                    Singh                      500000
4          5  Vivek                      Bhati                      500000
7          8  Geetika                    Chauhan                     90000

         joining_date                 department  year  month  day  \
0 2014-02-20 09:00:00  HR                         2014      2   20
1 2014-06-11 09:00:00  Admin                      2014      6   11
2 2014-02-20 09:00:00  HR                         2014      2   20
3 2014-02-20 09:00:00  Admin                      2014      2   20
4 2014-06-11 09:00:00  Admin                      2014      6   11
7 2014-04-11 09:00:00  Admin                      2014      4   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
0  Monika                     MonikA                        Monika Arora
1  Niharika                   NihArikA                    Niharika Verma
2  Vishal                     VishAl                      Vishal Singhal
3  Amitabh                    AmitAbh                      Amitabh Singh
4  Vivek                      Vivek                          Vivek Bhati
7  Geetika                    GeetikA                    Geetika Chauhan

In [31]:
# Q-15 Write an Pandas code to Print details of Workers with DEPARTMENT name starting with "Admin".

admin_workers = worker[worker['department'].str.startswith('Admin')]

# Printing the result
print("Details of Workers with DEPARTMENT name starting with 'Admin':")
print(admin_workers)

Details of Workers with DEPARTMENT name starting with 'Admin':
   worker_id                 first_name                  last_name  salary  \
1          2  Niharika                   Verma                       80000
3          4  Amitabh                    Singh                      500000
4          5  Vivek                      Bhati                      500000
7          8  Geetika                    Chauhan                     90000

         joining_date                 department  year  month  day  \
1 2014-06-11 09:00:00  Admin                      2014      6   11
3 2014-02-20 09:00:00  Admin                      2014      2   20
4 2014-06-11 09:00:00  Admin                      2014      6   11
7 2014-04-11 09:00:00  Admin                      2014      4   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
1  Niharika                   NihArikA                    Niharika Verma
3  Amitabh                    AmitAbh                      Amitabh Singh
4  Vivek                      Vivek                          Vivek Bhati
7  Geetika                    GeetikA                    Geetika Chauhan

In [32]:
# Q-16 Write an Pandas code to Print details of the Workers whose FIRST_NAME contains 'a'.

a_containing_workers = worker[worker['first_name'].str.contains('a', case=False)]

# Printing the result
print("Details of Workers whose FIRST_NAME contains 'a':")
print(a_containing_workers)

Details of Workers whose FIRST_NAME contains 'a':
   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
1          2  Niharika                   Verma                       80000
2          3  Vishal                     Singhal                    300000
3          4  Amitabh                    Singh                      500000
6          7  Satish                     Kumar                       75000
7          8  Geetika                    Chauhan                     90000

         joining_date                 department  year  month  day  \
0 2014-02-20 09:00:00  HR                         2014      2   20
1 2014-06-11 09:00:00  Admin                      2014      6   11
2 2014-02-20 09:00:00  HR                         2014      2   20
3 2014-02-20 09:00:00  Admin                      2014      2   20
6 2014-01-20 09:00:00  Account                    2014      1   20
7 2014-04-11 09:00:00  Admin                      2014      4   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
0  Monika                     MonikA                        Monika Arora
1  Niharika                   NihArikA                    Niharika Verma
2  Vishal                     VishAl                      Vishal Singhal
3  Amitabh                    AmitAbh                      Amitabh Singh
6  Satish                     SAtish                        Satish Kumar
7  Geetika                    GeetikA                    Geetika Chauhan

In [33]:
# Q-17 Write an Pandas code to Print details of the Workers whose FIRST_NAME ends with 'a'.

a_ending_workers = worker[worker['first_name'].astype(str).str.strip().str.endswith('a')]

# Printing the result
print("Details of Workers whose FIRST_NAME ends with 'a':")
print(a_ending_workers)

Details of Workers whose FIRST_NAME ends with 'a':
   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
1          2  Niharika                   Verma                       80000
7          8  Geetika                    Chauhan                     90000

         joining_date                 department  year  month  day  \
0 2014-02-20 09:00:00  HR                         2014      2   20
1 2014-06-11 09:00:00  Admin                      2014      6   11
7 2014-04-11 09:00:00  Admin                      2014      4   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
0  Monika                     MonikA                        Monika Arora
1  Niharika                   NihArikA                    Niharika Verma
7  Geetika                    GeetikA                    Geetika Chauhan

In [34]:
# Q-18 Write an Pandas code to Print details of the Workers whose FIRST_NAME ends with 'h' and contains six alphabets.

filtered_workers = worker[worker['first_name'].astype(str).str.strip().str.endswith('h') & (worker['first_name'].astype(str).str.strip().str.len() == 6)]

# Printing the result
print("Details of Workers whose FIRST_NAME ends with 'h' and has six alphabets:")
print(filtered_workers)

Details of Workers whose FIRST_NAME ends with 'h' and has six alphabets:
   worker_id                 first_name                  last_name  salary  \
6          7  Satish                     Kumar                       75000

         joining_date                 department  year  month  day  \
6 2014-01-20 09:00:00  Account                    2014      1   20

         FIRST_NAME_stripped        FIRST_NAME_modified COMPLETE_NAME
6  Satish                     SAtish                     Satish Kumar

In [35]:
# Q-19 Write an Pandas code to Print details of the Workers whose SALARY lies between 100,000 and 500,000.

filtered_workers = worker[(worker['salary'] >= 100000) & (worker['salary'] <= 500000)]

# Printing the result
print("Details of Workers whose SALARY is between 100,000 and 500,000:")
print(filtered_workers)

Details of Workers whose SALARY is between 100,000 and 500,000:
   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
2          3  Vishal                     Singhal                    300000
3          4  Amitabh                    Singh                      500000
4          5  Vivek                      Bhati                      500000
5          6  Vipul                      Diwan                      200000

         joining_date                 department  year  month  day  \
0 2014-02-20 09:00:00  HR                         2014      2   20
2 2014-02-20 09:00:00  HR                         2014      2   20
3 2014-02-20 09:00:00  Admin                      2014      2   20
4 2014-06-11 09:00:00  Admin                      2014      6   11
5 2014-06-11 09:00:00  Account                    2014      6   11

         FIRST_NAME_stripped        FIRST_NAME_modified   COMPLETE_NAME
0  Monika                     MonikA                       Monika Arora
2  Vishal                     VishAl                     Vishal Singhal
3  Amitabh                    AmitAbh                     Amitabh Singh
4  Vivek                      Vivek                         Vivek Bhati
5  Vipul                      Vipul                         Vipul Diwan

In [36]:
# Q-20 Write an Pandas code to Print details of the Workers who have joined in Feb 2014.

feb_2014_workers = worker[(worker['joining_date'].dt.month == 2) & (worker['joining_date'].dt.year == 2014)]

# Printing the result
print("Details of Workers who joined in Feb 2014:")
print(feb_2014_workers)

Details of Workers who joined in Feb 2014:
   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
2          3  Vishal                     Singhal                    300000
3          4  Amitabh                    Singh                      500000

         joining_date                 department  year  month  day  \
0 2014-02-20 09:00:00  HR                         2014      2   20
2 2014-02-20 09:00:00  HR                         2014      2   20
3 2014-02-20 09:00:00  Admin                      2014      2   20

         FIRST_NAME_stripped        FIRST_NAME_modified   COMPLETE_NAME
0  Monika                     MonikA                       Monika Arora
2  Vishal                     VishAl                     Vishal Singhal
3  Amitabh                    AmitAbh                     Amitabh Singh

In [37]:
#  Q-21. Write Pandas code to fetch the count of employees working in the department 'Admin'.

admin_count = worker['department'].str.strip().value_counts().get('Admin', 0)

# Printing the result
print("Number of employees working in the 'Admin' department after stripping whitespaces:", admin_count)

Number of employees working in the 'Admin' department after stripping whitespaces: 4

Backing off send_request(...) for 4.8s (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEB4CC970>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))
Backing off send_request(...) for 47.3s (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEC584BB0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))
Backing off send_request(...) for 233.0s (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEC584490>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))
Backing off send_request(...) for 42.7s (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEC584B80>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))
Giving up send_request(...) after 11 tries (requests.exceptions.ConnectionError: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEC584BB0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')))
error uploading: HTTPSConnectionPool(host='api.segment.io', port=443): Max retries exceeded with url: /v1/batch (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000024DEC584BB0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed'))

In [39]:
#  Q-22. Write Pandas code to fetch worker names with salaries >=   50000 and <= 100000.

filtered_df = worker[(worker['salary'] >= 50000) & (worker['salary'] <= 100000)]

# Extracting WorkerNames from the filtered DataFrame
selected_worker_names = filtered_df['first_name']
selected_worker_names

0    Monika
1    Niharika
6    Satish
7    Geetika
Name: first_name, dtype: object

In [40]:
# Q-23. Write Pandas code to fetch the no. of workers  for each department in the descending order.

department_counts = worker['department'].value_counts()

# Display the counts in descending order
department_counts = department_counts.sort_values(ascending=False)

print(department_counts)

Admin                        4
HR                           2
Account                      2
Name: department, dtype: int64

In [42]:
# Q-24. Write Pandas code to print details of the Workers  who are also Managers.

# Performing an inner join based on worker_id
merged_data = pd.merge(worker, title, left_on='worker_id', right_on='worker_ref_id', how='inner')

# Filtering the data for workers who are also managers
managers_data = merged_data[merged_data['worker_title'].str.strip() == 'Manager']

# Printing details of workers who are also managers
print(managers_data)

   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
4          5  Vivek                      Bhati                      500000

         joining_date                 department  year_x  month_x  day_x  \
0 2014-02-20 09:00:00  HR                           2014        2     20
4 2014-06-11 09:00:00  Admin                        2014        6     11

         FIRST_NAME_stripped        FIRST_NAME_modified COMPLETE_NAME  \
0  Monika                     MonikA                     Monika Arora
4  Vivek                      Vivek                       Vivek Bhati

   worker_ref_id               worker_title affected_from  year_y  month_y  \
0              1  Manager                      2016-02-20    2016        2
4              5  Manager                      2016-06-11    2016        6

   day_y
0     20
4     11

In [43]:

# Q-25. Write Pandas code to fetch duplicate records having matching data  in some fields of a table.

# Merge the dataframes
merged_data = pd.merge(worker, title, left_on='worker_id', right_on='worker_ref_id', how='inner')
merged_data = pd.merge(merged_data, bonus, on='worker_ref_id', how='inner')

# Find duplicates based on selected columns
duplicate_rows = merged_data[merged_data.duplicated(['first_name', 'last_name', 'joining_date'], keep=False)]

# Print the duplicate records
print("Duplicate Records:")
print(duplicate_rows)

Duplicate Records:
   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
1          1  Monika                     Arora                      100000
2          2  Niharika                   Verma                       80000
3          2  Niharika                   Verma                       80000

         joining_date                 department  year_x  month_x  day_x  \
0 2014-02-20 09:00:00  HR                           2014        2     20
1 2014-02-20 09:00:00  HR                           2014        2     20
2 2014-06-11 09:00:00  Admin                        2014        6     11
3 2014-06-11 09:00:00  Admin                        2014        6     11

         FIRST_NAME_stripped  ...               worker_title affected_from  \
0  Monika                     ...  Manager                      2016-02-20
1  Monika                     ...  Manager                      2016-02-20
2  Niharika                   ...  Executive                    2016-06-11
3  Niharika                   ...  Executive                    2016-06-11

   year_y month_y day_y  bonus_amount  bonus_date  year  month day
0    2016       2    20          5000  2020-02-16  2020      2  16
1    2016       2    20          4500  2020-02-16  2020      2  16
2    2016       6    11          3000  2011-06-16  2011      6  16
3    2016       6    11          3500  2011-06-16  2011      6  16

[4 rows x 23 columns]

In [44]:
# Q-26. Write Pandas code to show only odd rows from a table.

# Display only odd rows
odd_rows = worker.iloc[::2]  # Selecting every 2nd row starting from the first row
print(odd_rows)

   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
2          3  Vishal                     Singhal                    300000
4          5  Vivek                      Bhati                      500000
6          7  Satish                     Kumar                       75000

         joining_date                 department  year  month  day  \
0 2014-02-20 09:00:00  HR                         2014      2   20
2 2014-02-20 09:00:00  HR                         2014      2   20
4 2014-06-11 09:00:00  Admin                      2014      6   11
6 2014-01-20 09:00:00  Account                    2014      1   20

         FIRST_NAME_stripped        FIRST_NAME_modified   COMPLETE_NAME
0  Monika                     MonikA                       Monika Arora
2  Vishal                     VishAl                     Vishal Singhal
4  Vivek                      Vivek                         Vivek Bhati
6  Satish                     SAtish                       Satish Kumar

In [45]:
# Q-27. Write Pandas code to Show only even rows from a table.

# Display only even rows
even_rows = worker.iloc[1::2]  # Selecting every 2nd row starting from the second row
print(even_rows)

   worker_id                 first_name                  last_name  salary  \
1          2  Niharika                   Verma                       80000
3          4  Amitabh                    Singh                      500000
5          6  Vipul                      Diwan                      200000
7          8  Geetika                    Chauhan                     90000

         joining_date                 department  year  month  day  \
1 2014-06-11 09:00:00  Admin                      2014      6   11
3 2014-02-20 09:00:00  Admin                      2014      2   20
5 2014-06-11 09:00:00  Account                    2014      6   11
7 2014-04-11 09:00:00  Admin                      2014      4   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
1  Niharika                   NihArikA                    Niharika Verma
3  Amitabh                    AmitAbh                      Amitabh Singh
5  Vipul                      Vipul                          Vipul Diwan
7  Geetika                    GeetikA                    Geetika Chauhan

In [47]:
# Q-28. Write Pandas code to Clone a new table from another table.

# Using the copy() method
cloned_table_copy = worker.copy()
cloned_table_copy.head()

,worker_id,first_name,last_name,salary,joining_date,department,year,month,day,FIRST_NAME_stripped,FIRST_NAME_modified,COMPLETE_NAME
0,1,Monika,Arora,100000,2014-02-20 09:00:00,HR,2014,2,20,Monika,MonikA,Monika Arora
1,2,Niharika,Verma,80000,2014-06-11 09:00:00,Admin,2014,6,11,Niharika,NihArikA,Niharika Verma
2,3,Vishal,Singhal,300000,2014-02-20 09:00:00,HR,2014,2,20,Vishal,VishAl,Vishal Singhal
3,4,Amitabh,Singh,500000,2014-02-20 09:00:00,Admin,2014,2,20,Amitabh,AmitAbh,Amitabh Singh
4,5,Vivek,Bhati,500000,2014-06-11 09:00:00,Admin,2014,6,11,Vivek,Vivek,Vivek Bhati

In [48]:
# Q-29. Write Pandas code to Fetch intersecting records of two tables.

# Fetching intersecting records based on common columns
intersecting_records = pd.merge(worker, title, left_on='worker_id', right_on='worker_ref_id', how='inner')
intersecting_records = pd.merge(intersecting_records, bonus, on='worker_ref_id', how='inner')

# Displaying the intersecting records
print("Intersecting Records:")
print(intersecting_records)

Intersecting Records:
   worker_id                 first_name                  last_name  salary  \
0          1  Monika                     Arora                      100000
1          1  Monika                     Arora                      100000
2          2  Niharika                   Verma                       80000
3          2  Niharika                   Verma                       80000
4          3  Vishal                     Singhal                    300000

         joining_date                 department  year_x  month_x  day_x  \
0 2014-02-20 09:00:00  HR                           2014        2     20
1 2014-02-20 09:00:00  HR                           2014        2     20
2 2014-06-11 09:00:00  Admin                        2014        6     11
3 2014-06-11 09:00:00  Admin                        2014        6     11
4 2014-02-20 09:00:00  HR                           2014        2     20

         FIRST_NAME_stripped  ...               worker_title affected_from  \
0  Monika                     ...  Manager                      2016-02-20
1  Monika                     ...  Manager                      2016-02-20
2  Niharika                   ...  Executive                    2016-06-11
3  Niharika                   ...  Executive                    2016-06-11
4  Vishal                     ...  Lead                         2016-06-11

   year_y month_y day_y  bonus_amount  bonus_date  year  month day
0    2016       2    20          5000  2020-02-16  2020      2  16
1    2016       2    20          4500  2020-02-16  2020      2  16
2    2016       6    11          3000  2011-06-16  2011      6  16
3    2016       6    11          3500  2011-06-16  2011      6  16
4    2016       6    11          4000  2020-02-16  2020      2  16

[5 rows x 23 columns]

In [54]:
# Q-30. Write Pandas code to show records from one table  that another table does not have.

records_not_in_title = worker[~worker['worker_id'].astype(str).str.strip().isin(title['worker_ref_id'].astype(str).str.strip())]

# Displaying the records not in the 'title' DataFrame
print("Records in 'worker' that are not in 'title':")
print(records_not_in_title)

Records in 'worker' that are not in 'title':
Empty DataFrame
Columns: [worker_id, first_name, last_name, salary, joining_date, department, year, month, day, FIRST_NAME_stripped, FIRST_NAME_modified, COMPLETE_NAME]
Index: []

In [56]:
# Q-31. Write Pandas code to Show the top n (say 5) records of a table ordered by descending salary.

n = 5
top_n_records = worker.sort_values(by='salary', ascending=False).head(n)
top_n_records

,worker_id,first_name,last_name,salary,joining_date,department,year,month,day,FIRST_NAME_stripped,FIRST_NAME_modified,COMPLETE_NAME
3,4,Amitabh,Singh,500000,2014-02-20 09:00:00,Admin,2014,2,20,Amitabh,AmitAbh,Amitabh Singh
4,5,Vivek,Bhati,500000,2014-06-11 09:00:00,Admin,2014,6,11,Vivek,Vivek,Vivek Bhati
2,3,Vishal,Singhal,300000,2014-02-20 09:00:00,HR,2014,2,20,Vishal,VishAl,Vishal Singhal
5,6,Vipul,Diwan,200000,2014-06-11 09:00:00,Account,2014,6,11,Vipul,Vipul,Vipul Diwan
0,1,Monika,Arora,100000,2014-02-20 09:00:00,HR,2014,2,20,Monika,MonikA,Monika Arora

In [57]:
# Q-32. Write Pandas code to Determine the nth (say n=5) highest salary from a table.

n = 5
nth_highest_salary = worker['salary'].nlargest(n).iloc[-1]

# Displaying the nth highest salary
print(f"The {n}th highest salary is: {nth_highest_salary}")

The 5th highest salary is: 100000

In [58]:
# Q-33. Write Pandas code to Determine the 5th highest salary without using the nlargest keyword.

sorted_df = worker.sort_values(by='salary', ascending=False)

# Determine the 5th highest salary
n = 5
fifth_highest_salary = sorted_df.iloc[n - 1]['salary']

# Displaying the 5th highest salary
print(f"The {n}th highest salary is: {fifth_highest_salary}")

The 5th highest salary is: 100000

In [63]:
# Q-34. Write Pandas code to Fetch the list of employees with the same salary.

merged_df = pd.merge(worker, worker, on='salary', suffixes=('_w1', '_w2'))

# Filter rows where worker_id values are different
result = merged_df[(merged_df['worker_id_w1'] != merged_df['worker_id_w2'])]

# Displaying the result
print("Employees with the same salary but different worker_id:")
print(result)

Employees with the same salary but different worker_id:
   worker_id_w1              first_name_w1               last_name_w1  salary  \
4             4  Amitabh                    Singh                      500000
5             5  Vivek                      Bhati                      500000

      joining_date_w1              department_w1  year_w1  month_w1  day_w1  \
4 2014-02-20 09:00:00  Admin                         2014         2      20
5 2014-06-11 09:00:00  Admin                         2014         6      11

      FIRST_NAME_stripped_w1  ...              first_name_w2  \
4  Amitabh                    ...  Vivek
5  Vivek                      ...  Amitabh

                last_name_w2     joining_date_w2              department_w2  \
4  Bhati                     2014-06-11 09:00:00  Admin
5  Singh                     2014-02-20 09:00:00  Admin

  year_w2 month_w2 day_w2     FIRST_NAME_stripped_w2  \
4    2014        6     11  Vivek
5    2014        2     20  Amitabh

      FIRST_NAME_modified_w2  COMPLETE_NAME_w2
4  Vivek                           Vivek Bhati
5  AmitAbh                       Amitabh Singh

[2 rows x 23 columns]

In [64]:
# Q-35. Write Pandas code to Show the second-highest salary from a worker table

second_highest_salary = worker['salary'].unique()[-2]

# Displaying the second-highest salary
print(f"The second-highest salary is: {second_highest_salary}")

The second-highest salary is: 75000

In [66]:
# Q-36. Write Pandas code to List worker_id who does not get a bonus.

merged_data = pd.merge(worker, bonus, left_on='worker_id', right_on='worker_ref_id', how='left', indicator=True)
workers_without_bonus = merged_data[merged_data['_merge'] == 'left_only']['worker_id']

# Displaying worker_id without a bonus
print("Worker_id who does not get a bonus:")
print(workers_without_bonus)

Worker_id who does not get a bonus:
5    4
6    5
7    6
8    7
9    8
Name: worker_id, dtype: int64

In [67]:
# Q-37. Write Pandas code to Fetch the departments that have less than 4 people in it.

departments_less_than_4_people = worker.groupby('department')['worker_id'].count().reset_index(name='num_people')
departments_less_than_4_people = departments_less_than_4_people[departments_less_than_4_people['num_people'] < 4]

# Displaying the departments with less than 4 people
print("Departments with less than 4 people:")
print(departments_less_than_4_people[['department']])

Departments with less than 4 people:
                  department
0  Account
2  HR

In [68]:
# Q-38. Write Pandas code to Show all departments along with the number of people in there.

departments_and_people_count = worker.groupby('department')['worker_id'].count().reset_index(name='num_people')

# Displaying all departments along with the number of people
print("Departments along with the number of people:")
print(departments_and_people_count)

Departments along with the number of people:
                  department  num_people
0  Account                             2
1  Admin                               4
2  HR                                  2

In [69]:
# Q-39. Write Pandas code to Show the last record from a table.

last_record = worker.tail(1)

# Displaying the last record
print("Last record from the table:")
print(last_record)

Last record from the table:
   worker_id                 first_name                  last_name  salary  \
7          8  Geetika                    Chauhan                     90000

         joining_date                 department  year  month  day  \
7 2014-04-11 09:00:00  Admin                      2014      4   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
7  Geetika                    GeetikA                    Geetika Chauhan

In [70]:
# Q-40. Write Pandas code to Fetch the last five records from a table.

last_five_records = worker.tail(5)

# Displaying the last five records
print("Last five records from the table:")
print(last_five_records)

Last five records from the table:
   worker_id                 first_name                  last_name  salary  \
3          4  Amitabh                    Singh                      500000
4          5  Vivek                      Bhati                      500000
5          6  Vipul                      Diwan                      200000
6          7  Satish                     Kumar                       75000
7          8  Geetika                    Chauhan                     90000

         joining_date                 department  year  month  day  \
3 2014-02-20 09:00:00  Admin                      2014      2   20
4 2014-06-11 09:00:00  Admin                      2014      6   11
5 2014-06-11 09:00:00  Account                    2014      6   11
6 2014-01-20 09:00:00  Account                    2014      1   20
7 2014-04-11 09:00:00  Admin                      2014      4   11

         FIRST_NAME_stripped        FIRST_NAME_modified    COMPLETE_NAME
3  Amitabh                    AmitAbh                      Amitabh Singh
4  Vivek                      Vivek                          Vivek Bhati
5  Vipul                      Vipul                          Vipul Diwan
6  Satish                     SAtish                        Satish Kumar
7  Geetika                    GeetikA                    Geetika Chauhan

In [72]:
# Q-41. Write Pandas code to Print the employees with the highest salary in each department.

max_salary_indices = worker.groupby('department')['salary'].idxmax()

# Extract the corresponding records
employees_highest_salary = worker.loc[max_salary_indices]

# Displaying employees with the highest salary in each department
print("Employees with the highest salary in each department:")
print(employees_highest_salary)

Employees with the highest salary in each department:
   worker_id                 first_name                  last_name  salary  \
5          6  Vipul                      Diwan                      200000
3          4  Amitabh                    Singh                      500000
2          3  Vishal                     Singhal                    300000

         joining_date                 department  year  month  day  \
5 2014-06-11 09:00:00  Account                    2014      6   11
3 2014-02-20 09:00:00  Admin                      2014      2   20
2 2014-02-20 09:00:00  HR                         2014      2   20

         FIRST_NAME_stripped        FIRST_NAME_modified   COMPLETE_NAME
5  Vipul                      Vipul                         Vipul Diwan
3  Amitabh                    AmitAbh                     Amitabh Singh
2  Vishal                     VishAl                     Vishal Singhal

In [73]:
# Q-42. Write Pandas code to  Fetch three max salaries from a table

three_max_salaries = worker['salary'].nlargest(3)

# Displaying the three max salaries
print("Three max salaries from the table:")
print(three_max_salaries)

Three max salaries from the table:
3    500000
4    500000
2    300000
Name: salary, dtype: int64

In [74]:
# Q-43. Write Pandas code to  Fetch nth max salaries from a table (3 rd max salary).

n = 3
nth_max_salary = worker['salary'].nlargest(n).iloc[-1]

# Displaying the 3rd max salary
print(f"The {n}rd max salary is: {nth_max_salary}")

The 3rd max salary is: 300000

In [75]:
# Q-44. Write Pandas code to   Fetch departments along with the total salaries paid for each of them.

total_salaries_per_department = worker.groupby('department')['salary'].sum().reset_index(name='total_salary')

# Displaying departments along with total salaries
print("Departments along with the total salaries paid for each of them:")
print(total_salaries_per_department)

Departments along with the total salaries paid for each of them:
                  department  total_salary
0  Account                          275000
1  Admin                           1170000
2  HR                               400000

In [77]:
# Q-45. Write Pandas code to   Fetch the names of workers who earn the highest salary.

# Find the index of the maximum salary
max_salary_index = worker['salary'].idxmax()

highest_salary_workers = worker.loc[max_salary_index, ['first_name', 'last_name']]

# Displaying the names of workers who earn the highest salary
print("Names of workers who earn the highest salary:")
print(highest_salary_workers)

Names of workers who earn the highest salary:
first_name    Amitabh
last_name     Singh
Name: 3, dtype: object

In [78]:
# Q-46. Write Pandas code to print the name of employees  having the highest salary in each department.

# Define a function to get the employee with the highest salary in each department
def get_employee_with_highest_salary(group):
    return group.loc[group['salary'].idxmax(), ['first_name', 'last_name']]

# Apply the function to each department group
result = worker.groupby('department').apply(get_employee_with_highest_salary)

# Displaying the names of employees with the highest salary in each department
print("Names of employees with the highest salary in each department:")
print(result)

Names of employees with the highest salary in each department:
                                          first_name  \
department
Account                    Vipul
Admin                      Amitabh
HR                         Vishal

                                           last_name
department
Account                    Diwan
Admin                      Singh
HR                         Singhal

In [79]:
# Q-47. Write Pandas code to fetch three min salaries from a table.

three_min_salaries = worker['salary'].nsmallest(3)

# Displaying the three min salaries
print("Three min salaries from the table:")
print(three_min_salaries)

Three min salaries from the table:
6    75000
1    80000
7    90000
Name: salary, dtype: int64

In [80]:
# Q-48. Write Pandas code to fetch nth max salaries from a table.

n = 3
nth_max_salary = worker['salary'].nlargest(n).iloc[-1]

# Displaying the nth max salary
print(f"The {n}rd max salary is: {nth_max_salary}")

The 3rd max salary is: 300000

In [81]:
# Q-49. Write Pandas code to fetch departments along with the total salaries  paid for each of them.

total_salaries_per_department = worker.groupby('department')['salary'].sum().reset_index(name='total_salary')

# Displaying departments along with total salaries
print("Departments along with the total salaries paid for each of them:")
print(total_salaries_per_department)

Departments along with the total salaries paid for each of them:
                  department  total_salary
0  Account                          275000
1  Admin                           1170000
2  HR                               400000

In [83]:
# Q-50. Write Pandas code To Fetch The Names Of Workers Who Earn The Highest Salary.

highest_salary_row = worker.loc[worker['salary'].idxmax()]
highest_salary_names = f"{highest_salary_row['first_name']} {highest_salary_row['last_name']}"

# Displaying the names of workers with the highest salary
print(f"Names of workers who earn the highest salary: {highest_salary_names}")

Names of workers who earn the highest salary: Amitabh                   Singh